------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\GitHub\EconAnalysis\Participation\Results\Logs\contrmap.log
  log type:  text
 opened on:   8 Jun 2023, 14:27:51

. 
. ** Import data
. import delimited "dcm_data.csv"
(encoding automatically selected: ISO-8859-1)
(19 vars, 97,705 obs)

. gen id_obs = _n

. /* gen delta1 = rnormal(0,0.1)
> by fished_vessel_id selection, sort: egen delta = mean(delta1)
> drop delta1
>  */
. 
. ** Calculate the population shares
. cap drop s ln_s

. by fished_vessel_id, sort : egen count2 = total(fished)

. by fished_vessel_id selection, sort : egen count1 = total(fished)

. gen s=count1/count2

. replace s = 1/(10^5) if s == 0
(30,737 real changes made)

. gen ln_s=log(s) 

. drop count1 count2 

. sort id_obs

. 
. ** Set choice model database
. cmset fished_vessel_id time selection
note: case identifier _caseid generated from fished_vessel_id and time.
note: panel by alternatives identifier _panelaltid generated from fished_vessel_id
      and selection.
note: alternatives are unbalanced across choice sets; at least one choice set does
      not have all possible values of selection.

                    Panel data: Panels fished_vessel_id and time time
              Case ID variable: _caseid
         Alternatives variable: selection
Panel by alternatives variable: _panelaltid (unbalanced)
                 Time variable: time, 1 to 1823, but with gaps
                         Delta: 1 unit

Note: Data have been xtset.

. 
. *Estimate intical conditional logit
. cmclogit fished mean_rev_adj travel_cost wind_max_220_mh, ///
>         base("No-Participation") vce(cluster fished_vessel_id)

Iteration 0:  Log pseudolikelihood = -27206.869  
Iteration 1:  Log pseudolikelihood =  -26702.62  
Iteration 2:  Log pseudolikelihood = -26701.696  
Iteration 3:  Log pseudolikelihood = -26701.696  

Conditional logit choice model                 Number of obs      =     97,705
Case ID variable: _caseid                      Number of cases    =      19541

Alternatives variable: selection               Alts per case: min =          5
                                                              avg =        5.0
                                                              max =          5

                                                  Wald chi2(3)    =      40.72
Log pseudolikelihood = -26701.696                 Prob > chi2     =     0.0000

                         (Std. err. adjusted for 43 clusters in fished_vessel_id)
---------------------------------------------------------------------------------
                |               Robust
         fished | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
selection       |
   mean_rev_adj |    .036575   .0355258     1.03   0.303    -.0330542    .1062042
    travel_cost |  -.0000234   8.82e-06    -2.66   0.008    -.0000407   -6.15e-06
wind_max_220_mh |  -.0193654   .0047778    -4.05   0.000    -.0287297    -.010001
----------------+----------------------------------------------------------------
BDA_DCRB        |
          _cons |  -2.970666   1.097587    -2.71   0.007    -5.121896    -.819435
----------------+----------------------------------------------------------------
BDA_MSQD        |
          _cons |  -.4046368   1.070944    -0.38   0.706    -2.503649    1.694376
----------------+----------------------------------------------------------------
CBA_MSQD        |
          _cons |  -1.611752   1.120071    -1.44   0.150    -3.807051    .5835471
----------------+----------------------------------------------------------------
ERA_MSQD        |
          _cons |  -1.367894   .6294178    -2.17   0.030     -2.60153   -.1342577
----------------+----------------------------------------------------------------
LAA_BTNA        |
          _cons |  -.7233106     .48637    -1.49   0.137    -1.676578    .2299571
----------------+----------------------------------------------------------------
LAA_CMCK        |
          _cons |  -1.122753   .3517051    -3.19   0.001    -1.812082   -.4334237
----------------+----------------------------------------------------------------
LAA_JMCK        |
          _cons |  -.6801296   .4326456    -1.57   0.116    -1.528099    .1678403
----------------+----------------------------------------------------------------
LAA_MSQD        |
          _cons |  -.2039522   .3998359    -0.51   0.610    -.9876162    .5797119
----------------+----------------------------------------------------------------
LAA_NANC        |
          _cons |  -1.928102   .4166407    -4.63   0.000    -2.744702   -1.111501
----------------+----------------------------------------------------------------
LAA_PBNT        |
          _cons |  -.7748425    .468985    -1.65   0.099    -1.694036    .1443513
----------------+----------------------------------------------------------------
LAA_PSDN        |
          _cons |  -1.050483   .3411293    -3.08   0.002    -1.719084   -.3818813
----------------+----------------------------------------------------------------
LAA_RHRG        |
          _cons |  -4.128468   .9826046    -4.20   0.000    -6.054337   -2.202598
----------------+----------------------------------------------------------------
LAA_STNA        |
          _cons |  -1.355138   .8412414    -1.61   0.107    -3.003941    .2936645
----------------+----------------------------------------------------------------
LAA_YTNA        |
          _cons |  -.8870648   .4739366    -1.87   0.061    -1.815964    .0418339
----------------+----------------------------------------------------------------
MNA_ALBC        |
          _cons |   .3029309   1.400708     0.22   0.829    -2.442405    3.048267
----------------+----------------------------------------------------------------
MNA_CMCK        |
          _cons |  -1.334349   .3151327    -4.23   0.000    -1.951997   -.7166998
----------------+----------------------------------------------------------------
MNA_JMCK        |
          _cons |  -.7760546   .3378272    -2.30   0.022    -1.438184   -.1139255
----------------+----------------------------------------------------------------
MNA_LSKT        |
          _cons |    .531969   1.260794     0.42   0.673    -1.939143    3.003081
----------------+----------------------------------------------------------------
MNA_MSQD        |
          _cons |   .2630854   .2852222     0.92   0.356    -.2959398    .8221106
----------------+----------------------------------------------------------------
MNA_NANC        |
          _cons |  -.8808978   .3141862    -2.80   0.005    -1.496692   -.2651041
----------------+----------------------------------------------------------------
MNA_PSDN        |
          _cons |  -1.935176   .2546752    -7.60   0.000     -2.43433   -1.436022
----------------+----------------------------------------------------------------
MNA_UDAB        |
          _cons |   .3657461   1.214518     0.30   0.763    -2.014665    2.746158
----------------+----------------------------------------------------------------
MRA_MSQD        |
          _cons |  -1.311937   .5002984    -2.62   0.009    -2.292504   -.3313702
----------------+----------------------------------------------------------------
NPA_MSQD        |
          _cons |  -1.134688    .841255    -1.35   0.177    -2.783518    .5141411
----------------+----------------------------------------------------------------
No_Participat~n |  (base alternative)
----------------+----------------------------------------------------------------
SBA_CMCK        |
          _cons |  -1.470789   .3840919    -3.83   0.000    -2.223595   -.7179823
----------------+----------------------------------------------------------------
SBA_JMCK        |
          _cons |  -2.809024   .9996823    -2.81   0.005    -4.768365   -.8496827
----------------+----------------------------------------------------------------
SBA_MSQD        |
          _cons |   .2957269    .337058     0.88   0.380    -.3648946    .9563484
----------------+----------------------------------------------------------------
SBA_PBNT        |
          _cons |   -1.74686   .7323491    -2.39   0.017    -3.182238   -.3114822
----------------+----------------------------------------------------------------
SBA_PSDN        |
          _cons |  -2.146675   .6895456    -3.11   0.002    -3.498159   -.7951902
----------------+----------------------------------------------------------------
SBA_UMCK        |
          _cons |  -1.805411   1.007606    -1.79   0.073    -3.780283    .1694603
----------------+----------------------------------------------------------------
SDA_BTNA        |
          _cons |  -.2235773   1.049167    -0.21   0.831    -2.279907    1.832753
----------------+----------------------------------------------------------------
SFA_CHNK        |
          _cons |  -.3576936   1.197179    -0.30   0.765    -2.704121    1.988734
----------------+----------------------------------------------------------------
SFA_DCRB        |
          _cons |  -1.673286   1.102841    -1.52   0.129    -3.834815    .4882437
----------------+----------------------------------------------------------------
SFA_MSQD        |
          _cons |   .2833237   .4804384     0.59   0.555    -.6583183    1.224966
----------------+----------------------------------------------------------------
SFA_NANC        |
          _cons |  -.2976349   .7166817    -0.42   0.678    -1.702305    1.107035
---------------------------------------------------------------------------------

. 
. gen delta = 0

. replace delta = _b[BDA_DCRB:_cons] if selection == "BDA-DCRB"
(890 real changes made)

. replace delta = _b[BDA_MSQD:_cons] if selection == "BDA-MSQD"
(107 real changes made)

. replace delta = _b[CBA_MSQD:_cons] if selection == "CBA-MSQD"
(70 real changes made)

. replace delta = _b[ERA_MSQD:_cons] if selection == "ERA-MSQD"
(1,022 real changes made)

. replace delta = _b[LAA_BTNA:_cons] if selection == "LAA-BTNA"
(530 real changes made)

. replace delta = _b[LAA_CMCK:_cons] if selection == "LAA-CMCK"
(4,097 real changes made)

. replace delta = _b[LAA_JMCK:_cons] if selection == "LAA-JMCK"
(287 real changes made)

. replace delta = _b[LAA_MSQD:_cons] if selection == "LAA-MSQD"
(14,959 real changes made)

. replace delta = _b[LAA_NANC:_cons] if selection == "LAA-NANC"
(2,074 real changes made)

. replace delta = _b[LAA_PBNT:_cons] if selection == "LAA-PBNT"
(326 real changes made)

. replace delta = _b[LAA_PSDN:_cons] if selection == "LAA-PSDN"
(1,635 real changes made)

. replace delta = _b[LAA_RHRG:_cons] if selection == "LAA-RHRG"
(129 real changes made)

. replace delta = _b[LAA_STNA:_cons] if selection == "LAA-STNA"
(57 real changes made)

. replace delta = _b[LAA_YTNA:_cons] if selection == "LAA-YTNA"
(1,657 real changes made)

. replace delta = _b[MNA_ALBC:_cons] if selection == "MNA-ALBC"
(48 real changes made)

. replace delta = _b[MNA_CMCK:_cons] if selection == "MNA-CMCK"
(197 real changes made)

. replace delta = _b[MNA_JMCK:_cons] if selection == "MNA-JMCK"
(285 real changes made)

. replace delta = _b[MNA_LSKT:_cons] if selection == "MNA-LSKT"
(3 real changes made)

. replace delta = _b[MNA_MSQD:_cons] if selection == "MNA-MSQD"
(11,001 real changes made)

. replace delta = _b[MNA_NANC:_cons] if selection == "MNA-NANC"
(6,674 real changes made)

. replace delta = _b[MNA_PSDN:_cons] if selection == "MNA-PSDN"
(3,726 real changes made)

. replace delta = _b[MNA_UDAB:_cons] if selection == "MNA-UDAB"
(3 real changes made)

. replace delta = _b[MRA_MSQD:_cons] if selection == "MRA-MSQD"
(3,027 real changes made)

. replace delta = _b[NPA_MSQD:_cons] if selection == "NPA-MSQD"
(265 real changes made)

. replace delta = _b[SBA_CMCK:_cons] if selection == "SBA-CMCK"
(796 real changes made)

. replace delta = _b[SBA_JMCK:_cons] if selection == "SBA-JMCK"
(99 real changes made)

. replace delta = _b[SBA_MSQD:_cons] if selection == "SBA-MSQD"
(16,495 real changes made)

. replace delta = _b[SBA_PBNT:_cons] if selection == "SBA-PBNT"
(119 real changes made)

. replace delta = _b[SBA_PSDN:_cons] if selection == "SBA-PSDN"
(304 real changes made)

. replace delta = _b[SBA_UMCK:_cons] if selection == "SBA-UMCK"
(21 real changes made)

. replace delta = _b[SDA_BTNA:_cons] if selection == "SDA-BTNA"
(31 real changes made)

. replace delta = _b[SFA_CHNK:_cons] if selection == "SFA-CHNK"
(6 real changes made)

. replace delta = _b[SFA_DCRB:_cons] if selection == "SFA-DCRB"
(1,939 real changes made)

. replace delta = _b[SFA_MSQD:_cons] if selection == "SFA-MSQD"
(5,030 real changes made)

. replace delta = _b[SFA_NANC:_cons] if selection == "SFA-NANC"
(255 real changes made)

. 
. 
. *Estimate intical conditional logit
. constraint 1 delta=1

. cmclogit fished mean_rev_adj travel_cost wind_max_220_mh delta, ///
>         base("No-Participation") noconstant constraints(1) vce(cluster fished_vess
> el_id)

Iteration 0:  Log pseudolikelihood = -27062.636  
Iteration 1:  Log pseudolikelihood = -26701.873  
Iteration 2:  Log pseudolikelihood = -26701.696  
Iteration 3:  Log pseudolikelihood = -26701.696  

Conditional logit choice model                 Number of obs      =     97,705
Case ID variable: _caseid                      Number of cases    =      19541

Alternatives variable: selection               Alts per case: min =          5
                                                              avg =        5.0
                                                              max =          5

                                                  Wald chi2(3)    =      56.09
Log pseudolikelihood = -26701.696                 Prob > chi2     =     0.0000

 ( 1)  [selection]delta = 1
                         (Std. err. adjusted for 43 clusters in fished_vessel_id)
---------------------------------------------------------------------------------
                |               Robust
         fished | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
selection       |
   mean_rev_adj |    .036575   .0444333     0.82   0.410    -.0505126    .1236626
    travel_cost |  -.0000234   .0000103    -2.27   0.023    -.0000436   -3.23e-06
wind_max_220_mh |  -.0193654   .0080035    -2.42   0.016     -.035052   -.0036787
          delta |          1  (constrained)
---------------------------------------------------------------------------------

. 
. 
. *Start contraction mapping
. matrix start=e(b)

.   cap drop phat

.   qui predict phat

.   cap drop p_share

.   qui by fished_vessel_id selection, sort : egen p_share = mean(phat)

.   cap drop lnp_share

.   qui gen lnp_share = log(p_share)

.   qui replace delta = delta + ln_s - lnp_share

.   putmata x=(lnp_share ln_s), replace
(1 matrix posted)

.   mata: dif=mreldif(x[.,1],x[.,2]) /*get initial relative diff between actual adn 
> est shares*/

.   mata: st_local("dif", strofreal(dif))

.   di `dif'
1.614303

. 
.  while `dif'>0.001 {
  2.         set more off
  3.         cmclogit fished mean_rev_adj travel_cost wind_max_220_mh delta, ///
>         base("No-Participation") noconstant constraints(1) vce(cluster fished_vess
> el_id) ///
>         from(start, copy)
  4.         matrix start=e(b)
  5.         drop phat p_share lnp_share
  6.         qui predict phat
  7.         qui by fished_vessel_id selection, sort : egen p_share = mean(phat)
  8.         qui gen lnp_share = log(p_share)
  9.         qui replace delta = delta + ln_s - lnp_share
 10.         putmata x=(lnp_share ln_s), replace
 11.         mata: dif=mreldif(x[.,1],x[.,2]) /*get initial relative diff between ac
> tual adn est shares*/
 12.         mata: st_local("dif", strofreal(dif))
 13.         di `dif'
 14.   }

Iteration 0:  Log pseudolikelihood = -19402.229  
Iteration 1:  Log pseudolikelihood = -18868.086  
Iteration 2:  Log pseudolikelihood = -18864.175  
Iteration 3:  Log pseudolikelihood = -18864.175  

Conditional logit choice model                 Number of obs      =     97,705
Case ID variable: _caseid                      Number of cases    =      19541

Alternatives variable: selection               Alts per case: min =          5
                                                              avg =        5.0
                                                              max =          5

                                                  Wald chi2(3)    =     145.56
Log pseudolikelihood = -18864.175                 Prob > chi2     =     0.0000

 ( 1)  [selection]delta = 1
                         (Std. err. adjusted for 43 clusters in fished_vessel_id)
---------------------------------------------------------------------------------
                |               Robust
         fished | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
selection       |
   mean_rev_adj |  -.0208353   .0276615    -0.75   0.451    -.0750509    .0333802
    travel_cost |  -.0000118   8.31e-06    -1.43   0.154    -.0000281    4.43e-06
wind_max_220_mh |   .0329795    .005924     5.57   0.000     .0213686    .0445903
          delta |          1  (constrained)
---------------------------------------------------------------------------------
(1 matrix posted)
.5382964

Iteration 0:  Log pseudolikelihood = -19527.195  
Iteration 1:  Log pseudolikelihood = -19248.876  
Iteration 2:  Log pseudolikelihood = -19248.599  
Iteration 3:  Log pseudolikelihood = -19248.599  

Conditional logit choice model                 Number of obs      =     97,705
Case ID variable: _caseid                      Number of cases    =      19541

Alternatives variable: selection               Alts per case: min =          5
                                                              avg =        5.0
                                                              max =          5

                                                  Wald chi2(3)    =      75.19
Log pseudolikelihood = -19248.599                 Prob > chi2     =     0.0000

 ( 1)  [selection]delta = 1
                         (Std. err. adjusted for 43 clusters in fished_vessel_id)
---------------------------------------------------------------------------------
                |               Robust
         fished | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
selection       |
   mean_rev_adj |  -.0081642   .0293994    -0.28   0.781     -.065786    .0494576
    travel_cost |  -.0000138   8.70e-06    -1.58   0.113    -.0000308    3.28e-06
wind_max_220_mh |   .0571786   .0066096     8.65   0.000     .0442241    .0701331
          delta |          1  (constrained)
---------------------------------------------------------------------------------
(1 matrix posted)
.4609848

Iteration 0:  Log pseudolikelihood = -19698.276  
Iteration 1:  Log pseudolikelihood = -19469.901  
Iteration 2:  Log pseudolikelihood = -19469.613  
Iteration 3:  Log pseudolikelihood = -19469.613  

Conditional logit choice model                 Number of obs      =     97,705
Case ID variable: _caseid                      Number of cases    =      19541

Alternatives variable: selection               Alts per case: min =          5
                                                              avg =        5.0
                                                              max =          5

                                                  Wald chi2(3)    =     187.11
Log pseudolikelihood = -19469.613                 Prob > chi2     =     0.0000

 ( 1)  [selection]delta = 1
                         (Std. err. adjusted for 43 clusters in fished_vessel_id)
---------------------------------------------------------------------------------
                |               Robust
         fished | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
selection       |
   mean_rev_adj |   .0154081   .0300793     0.51   0.608    -.0435463    .0743625
    travel_cost |   -.000017   8.82e-06    -1.93   0.054    -.0000343    3.03e-07
wind_max_220_mh |   .0729812   .0069876    10.44   0.000     .0592859    .0866766
          delta |          1  (constrained)
---------------------------------------------------------------------------------
(1 matrix posted)
.4548969

Iteration 0:  Log pseudolikelihood = -19834.392  
Iteration 1:  Log pseudolikelihood = -19630.847  
Iteration 2:  Log pseudolikelihood = -19630.547  
Iteration 3:  Log pseudolikelihood = -19630.547  

Conditional logit choice model                 Number of obs      =     97,705
Case ID variable: _caseid                      Number of cases    =      19541

Alternatives variable: selection               Alts per case: min =          5
                                                              avg =        5.0
                                                              max =          5

                                                  Wald chi2(3)    =     415.73
Log pseudolikelihood = -19630.547                 Prob > chi2     =     0.0000

 ( 1)  [selection]delta = 1
                         (Std. err. adjusted for 43 clusters in fished_vessel_id)
---------------------------------------------------------------------------------
                |               Robust
         fished | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
selection       |
   mean_rev_adj |   .0418001    .030498     1.37   0.171    -.0179749    .1015751
    travel_cost |  -.0000203   8.91e-06    -2.28   0.023    -.0000378   -2.85e-06
wind_max_220_mh |   .0849751   .0071839    11.83   0.000     .0708949    .0990554
          delta |          1  (constrained)
---------------------------------------------------------------------------------
(1 matrix posted)
.4446542

Iteration 0:  Log pseudolikelihood = -19958.881  
Iteration 1:  Log pseudolikelihood = -19772.924  
Iteration 2:  Log pseudolikelihood = -19772.647  
Iteration 3:  Log pseudolikelihood = -19772.647  

Conditional logit choice model                 Number of obs      =     97,705
Case ID variable: _caseid                      Number of cases    =      19541

Alternatives variable: selection               Alts per case: min =          5
                                                              avg =        5.0
                                                              max =          5

                                                  Wald chi2(3)    =     751.43
Log pseudolikelihood = -19772.647                 Prob > chi2     =     0.0000

 ( 1)  [selection]delta = 1
                         (Std. err. adjusted for 43 clusters in fished_vessel_id)
---------------------------------------------------------------------------------
                |               Robust
         fished | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
selection       |
   mean_rev_adj |   .0684613   .0308429     2.22   0.026     .0080102    .1289123
    travel_cost |  -.0000235   9.01e-06    -2.61   0.009    -.0000412   -5.87e-06
wind_max_220_mh |   .0950913   .0072899    13.04   0.000     .0808034    .1093791
          delta |          1  (constrained)
---------------------------------------------------------------------------------
(1 matrix posted)
.4338311

Iteration 0:  Log pseudolikelihood = -20084.937  
Iteration 1:  Log pseudolikelihood = -19913.556  
Iteration 2:  Log pseudolikelihood = -19913.317  
Iteration 3:  Log pseudolikelihood = -19913.317  

Conditional logit choice model                 Number of obs      =     97,705
Case ID variable: _caseid                      Number of cases    =      19541

Alternatives variable: selection               Alts per case: min =          5
                                                              avg =        5.0
                                                              max =          5

                                                  Wald chi2(3)    =    1186.11
Log pseudolikelihood = -19913.317                 Prob > chi2     =     0.0000

 ( 1)  [selection]delta = 1
                         (Std. err. adjusted for 43 clusters in fished_vessel_id)
---------------------------------------------------------------------------------
                |               Robust
         fished | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
selection       |
   mean_rev_adj |   .0945005   .0311753     3.03   0.002      .033398     .155603
    travel_cost |  -.0000266   9.11e-06    -2.91   0.004    -.0000444   -8.70e-06
wind_max_220_mh |    .104217   .0073558    14.17   0.000     .0897999    .1186341
          delta |          1  (constrained)
---------------------------------------------------------------------------------
(1 matrix posted)
.4250859

Iteration 0:  Log pseudolikelihood = -20218.682  
Iteration 1:  Log pseudolikelihood = -20060.182  
Iteration 2:  Log pseudolikelihood = -20059.983  
Iteration 3:  Log pseudolikelihood = -20059.983  

Conditional logit choice model                 Number of obs      =     97,705
Case ID variable: _caseid                      Number of cases    =      19541

Alternatives variable: selection               Alts per case: min =          5
                                                              avg =        5.0
                                                              max =          5

                                                  Wald chi2(3)    =    1710.65
Log pseudolikelihood = -20059.983                 Prob > chi2     =     0.0000

 ( 1)  [selection]delta = 1
                         (Std. err. adjusted for 43 clusters in fished_vessel_id)
---------------------------------------------------------------------------------
                |               Robust
         fished | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
selection       |
   mean_rev_adj |   .1196101   .0315158     3.80   0.000     .0578402      .18138
    travel_cost |  -.0000294   9.22e-06    -3.19   0.001    -.0000475   -.0000114
wind_max_220_mh |   .1127783   .0074078    15.22   0.000     .0982593    .1272973
          delta |          1  (constrained)
---------------------------------------------------------------------------------
(1 matrix posted)
.4304126

Iteration 0:  Log pseudolikelihood = -20362.493  
Iteration 1:  Log pseudolikelihood = -20215.675  
Iteration 2:  Log pseudolikelihood = -20215.511  
Iteration 3:  Log pseudolikelihood = -20215.511  

Conditional logit choice model                 Number of obs      =     97,705
Case ID variable: _caseid                      Number of cases    =      19541

Alternatives variable: selection               Alts per case: min =          5
                                                              avg =        5.0
                                                              max =          5

                                                  Wald chi2(3)    =    2315.06
Log pseudolikelihood = -20215.511                 Prob > chi2     =     0.0000

 ( 1)  [selection]delta = 1
                         (Std. err. adjusted for 43 clusters in fished_vessel_id)
---------------------------------------------------------------------------------
                |               Robust
         fished | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
selection       |
   mean_rev_adj |   .1437053   .0318707     4.51   0.000       .08124    .2061707
    travel_cost |  -.0000321   9.33e-06    -3.44   0.001    -.0000504   -.0000139
wind_max_220_mh |   .1209848   .0074586    16.22   0.000     .1063663    .1356034
          delta |          1  (constrained)
---------------------------------------------------------------------------------
(1 matrix posted)
.434342

Iteration 0:  Log pseudolikelihood = -20516.858  
Iteration 1:  Log pseudolikelihood = -20380.738  
Iteration 2:  Log pseudolikelihood = -20380.604  
Iteration 3:  Log pseudolikelihood = -20380.604  

Conditional logit choice model                 Number of obs      =     97,705
Case ID variable: _caseid                      Number of cases    =      19541

Alternatives variable: selection               Alts per case: min =          5
                                                              avg =        5.0
                                                              max =          5

                                                  Wald chi2(3)    =    2988.86
Log pseudolikelihood = -20380.604                 Prob > chi2     =     0.0000

 ( 1)  [selection]delta = 1
                         (Std. err. adjusted for 43 clusters in fished_vessel_id)
---------------------------------------------------------------------------------
                |               Robust
         fished | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
selection       |
   mean_rev_adj |   .1667924   .0322412     5.17   0.000     .1036009    .2299839
    travel_cost |  -.0000347   9.45e-06    -3.68   0.000    -.0000532   -.0000162
wind_max_220_mh |   .1289404   .0075141    17.16   0.000     .1142131    .1436677
          delta |          1  (constrained)
---------------------------------------------------------------------------------
(1 matrix posted)
.4373147

Iteration 0:  Log pseudolikelihood = -20681.325  
Iteration 1:  Log pseudolikelihood =  -20555.03  
Iteration 2:  Log pseudolikelihood = -20554.922  
Iteration 3:  Log pseudolikelihood = -20554.922  

Conditional logit choice model                 Number of obs      =     97,705
Case ID variable: _caseid                      Number of cases    =      19541

Alternatives variable: selection               Alts per case: min =          5
                                                              avg =        5.0
                                                              max =          5

                                                  Wald chi2(3)    =    3721.47
Log pseudolikelihood = -20554.922                 Prob > chi2     =     0.0000

 ( 1)  [selection]delta = 1
                         (Std. err. adjusted for 43 clusters in fished_vessel_id)
---------------------------------------------------------------------------------
                |               Robust
         fished | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
selection       |
   mean_rev_adj |    .188917    .032627     5.79   0.000     .1249692    .2528648
    travel_cost |  -.0000372   9.57e-06    -3.89   0.000     -.000056   -.0000185
wind_max_220_mh |   .1366956   .0075768    18.04   0.000     .1218454    .1515458
          delta |          1  (constrained)
---------------------------------------------------------------------------------
(1 matrix posted)
.4396088

Iteration 0:  Log pseudolikelihood = -20854.992  
Iteration 1:  Log pseudolikelihood = -20737.719  
Iteration 2:  Log pseudolikelihood = -20737.631  
Iteration 3:  Log pseudolikelihood = -20737.631  

Conditional logit choice model                 Number of obs      =     97,705
Case ID variable: _caseid                      Number of cases    =      19541

Alternatives variable: selection               Alts per case: min =          5
                                                              avg =        5.0
                                                              max =          5

                                                  Wald chi2(3)    =    4502.58
Log pseudolikelihood = -20737.631                 Prob > chi2     =     0.0000

 ( 1)  [selection]delta = 1
                         (Std. err. adjusted for 43 clusters in fished_vessel_id)
---------------------------------------------------------------------------------
                |               Robust
         fished | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
selection       |
   mean_rev_adj |   .2101417   .0330276     6.36   0.000     .1454088    .2748746
    travel_cost |  -.0000396   9.69e-06    -4.09   0.000    -.0000586   -.0000206
wind_max_220_mh |   .1442741   .0076472    18.87   0.000     .1292859    .1592622
          delta |          1  (constrained)
---------------------------------------------------------------------------------
(1 matrix posted)
.4414081

Iteration 0:  Log pseudolikelihood =  -21036.76  
Iteration 1:  Log pseudolikelihood = -20927.763  
Iteration 2:  Log pseudolikelihood = -20927.691  
Iteration 3:  Log pseudolikelihood = -20927.691  

Conditional logit choice model                 Number of obs      =     97,705
Case ID variable: _caseid                      Number of cases    =      19541

Alternatives variable: selection               Alts per case: min =          5
                                                              avg =        5.0
                                                              max =          5

                                                  Wald chi2(3)    =    5322.40
Log pseudolikelihood = -20927.691                 Prob > chi2     =     0.0000

 ( 1)  [selection]delta = 1
                         (Std. err. adjusted for 43 clusters in fished_vessel_id)
---------------------------------------------------------------------------------
                |               Robust
         fished | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
selection       |
   mean_rev_adj |   .2305349   .0334416     6.89   0.000     .1649905    .2960793
    travel_cost |  -.0000419   9.81e-06    -4.27   0.000    -.0000611   -.0000226
wind_max_220_mh |   .1516861   .0077249    19.64   0.000     .1365456    .1668266
          delta |          1  (constrained)
---------------------------------------------------------------------------------
(1 matrix posted)
.4428385

Iteration 0:  Log pseudolikelihood = -21225.488  
Iteration 1:  Log pseudolikelihood = -21124.071  
Iteration 2:  Log pseudolikelihood = -21124.013  
Iteration 3:  Log pseudolikelihood = -21124.013  

Conditional logit choice model                 Number of obs      =     97,705
Case ID variable: _caseid                      Number of cases    =      19541

Alternatives variable: selection               Alts per case: min =          5
                                                              avg =        5.0
                                                              max =          5

                                                  Wald chi2(3)    =    6171.90
Log pseudolikelihood = -21124.013                 Prob > chi2     =     0.0000

 ( 1)  [selection]delta = 1
                         (Std. err. adjusted for 43 clusters in fished_vessel_id)
---------------------------------------------------------------------------------
                |               Robust
         fished | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
selection       |
   mean_rev_adj |   .2501648   .0338677     7.39   0.000     .1837853    .3165442
    travel_cost |  -.0000441   9.94e-06    -4.43   0.000    -.0000636   -.0000246
wind_max_220_mh |   .1589357    .007809    20.35   0.000     .1436303     .174241
          delta |          1  (constrained)
---------------------------------------------------------------------------------
(1 matrix posted)
.4439885

Iteration 0:  Log pseudolikelihood = -21420.072  
Iteration 1:  Log pseudolikelihood = -21325.588  
Iteration 2:  Log pseudolikelihood = -21325.541  
Iteration 3:  Log pseudolikelihood = -21325.541  

Conditional logit choice model                 Number of obs      =     97,705
Case ID variable: _caseid                      Number of cases    =      19541

Alternatives variable: selection               Alts per case: min =          5
                                                              avg =        5.0
                                                              max =          5

                                                  Wald chi2(3)    =    7042.89
Log pseudolikelihood = -21325.541                 Prob > chi2     =     0.0000

 ( 1)  [selection]delta = 1
                         (Std. err. adjusted for 43 clusters in fished_vessel_id)
---------------------------------------------------------------------------------
                |               Robust
         fished | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
selection       |
   mean_rev_adj |   .2690957    .034304     7.84   0.000     .2018611    .3363303
    travel_cost |  -.0000462   .0000101    -4.59   0.000    -.0000659   -.0000265
wind_max_220_mh |   .1660245   .0078985    21.02   0.000     .1505438    .1815052
          delta |          1  (constrained)
---------------------------------------------------------------------------------
(1 matrix posted)
.444922

Iteration 0:  Log pseudolikelihood = -21619.491  
Iteration 1:  Log pseudolikelihood = -21531.346  
Iteration 2:  Log pseudolikelihood = -21531.307  
Iteration 3:  Log pseudolikelihood = -21531.307  

Conditional logit choice model                 Number of obs      =     97,705
Case ID variable: _caseid                      Number of cases    =      19541

Alternatives variable: selection               Alts per case: min =          5
                                                              avg =        5.0
                                                              max =          5

                                                  Wald chi2(3)    =    7928.17
Log pseudolikelihood = -21531.307                 Prob > chi2     =     0.0000

 ( 1)  [selection]delta = 1
                         (Std. err. adjusted for 43 clusters in fished_vessel_id)
---------------------------------------------------------------------------------
                |               Robust
         fished | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
selection       |
   mean_rev_adj |   .2873867   .0347485     8.27   0.000     .2192809    .3554925
    travel_cost |  -.0000483   .0000102    -4.73   0.000    -.0000683   -.0000283
wind_max_220_mh |   .1729538   .0079922    21.64   0.000     .1572895    .1886182
          delta |          1  (constrained)
---------------------------------------------------------------------------------
(1 matrix posted)
.445686

Iteration 0:  Log pseudolikelihood = -21822.833  
Iteration 1:  Log pseudolikelihood = -21740.478  
Iteration 2:  Log pseudolikelihood = -21740.446  
Iteration 3:  Log pseudolikelihood = -21740.446  

Conditional logit choice model                 Number of obs      =     97,705
Case ID variable: _caseid                      Number of cases    =      19541

Alternatives variable: selection               Alts per case: min =          5
                                                              avg =        5.0
                                                              max =          5

                                                  Wald chi2(3)    =    8821.47
Log pseudolikelihood = -21740.446                 Prob > chi2     =     0.0000

 ( 1)  [selection]delta = 1
                         (Std. err. adjusted for 43 clusters in fished_vessel_id)
---------------------------------------------------------------------------------
                |               Robust
         fished | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
selection       |
   mean_rev_adj |   .3050904    .035199     8.67   0.000     .2361016    .3740793
    travel_cost |  -.0000503   .0000103    -4.87   0.000    -.0000705     -.00003
wind_max_220_mh |   .1797256   .0080892    22.22   0.000     .1638711      .19558
          delta |          1  (constrained)
---------------------------------------------------------------------------------
(1 matrix posted)
.4463159
variable selection has replicate levels for one or more cases; this is not allowed
r(459);

end of do-file

r(459);

. save c:\users\fequezad\appdata\local\temp\emergency_close_stata_st.dta, replace
(file c:\users\fequezad\appdata\local\temp\emergency_close_stata_st.dta not found)
file c:\users\fequezad\appdata\local\temp\emergency_close_stata_st.dta saved
