---------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\GitHub\EconAnalysis\Participation\Results\Logs\preliminary.log
  log type:  text
 opened on:   5 Oct 2023, 14:52:43

. 
. ** Import data
. import delimited "Stata\rdo_Stata_c4.csv"
(encoding automatically selected: ISO-8859-1)
(36 vars, 118,992 obs)

. replace mean_price = mean_price / 1000
(98,875 real changes made)

. gen id_obs = _n

. 
. ** Set choice model database
. cmset fished_vessel_id time selection
note: case identifier _caseid generated from fished_vessel_id and time.
note: panel by alternatives identifier _panelaltid generated from fished_vessel_id and selection.
note: alternatives are unbalanced across choice sets; at least one choice set does not have all possible values of selection.

                    Panel data: Panels fished_vessel_id and time time
              Case ID variable: _caseid
         Alternatives variable: selection
Panel by alternatives variable: _panelaltid (unbalanced)
                 Time variable: time, 1 to 1823, but with gaps
                         Delta: 1 unit

Note: Data have been xtset.

. // cmset fished_haul selection
. sort id_obs

. 
. 
. * Preferred model 
. gen species = substr(selection,-4,.) 

. replace species = "No-Participation" if species == "tion" 
variable species was str4 now str16
(19,832 real changes made)

. encode species, gen(nspecies)

. 
. cmclogit fished mean_avail mean_price diesel_price wind_max_220_mh d_missing dist_port_to_catch_area_zero d_missing_d dist_to_cog ///
>                 ddieselstate psdnclosured msqdclosured msqdweekend, base("No-Participation")
note: data were cmset as panel data, and the default vcetype for panel data is vce(cluster fished_vessel_id); see cmclogit.
note: variable d_missing has 17454 cases that are not alternative-specific; there is no within-case variability.
note: variable dist_port_to_catch_area_zero has 5 cases that are not alternative-specific; there is no within-case variability.
note: variable d_missing_d has 6947 cases that are not alternative-specific; there is no within-case variability.
note: variable ddieselstate has 11708 cases that are not alternative-specific; there is no within-case variability.
note: variable psdnclosured has 17419 cases that are not alternative-specific; there is no within-case variability.
note: variable msqdclosured has 19102 cases that are not alternative-specific; there is no within-case variability.
note: variable msqdweekend has 16500 cases that are not alternative-specific; there is no within-case variability.

Iteration 0:  Log pseudolikelihood = -21478.361  
Iteration 1:  Log pseudolikelihood = -20579.958  
Iteration 2:  Log pseudolikelihood = -20513.958  
Iteration 3:  Log pseudolikelihood = -20501.647  
Iteration 4:  Log pseudolikelihood = -20498.986  
Iteration 5:  Log pseudolikelihood = -20498.404  
Iteration 6:  Log pseudolikelihood = -20498.321  
Iteration 7:  Log pseudolikelihood =  -20498.31  
Iteration 8:  Log pseudolikelihood = -20498.308  
Iteration 9:  Log pseudolikelihood = -20498.308  
Iteration 10: Log pseudolikelihood = -20498.308  
Iteration 11: Log pseudolikelihood = -20498.308  

Conditional logit choice model                 Number of obs      =    118,992
Case ID variable: _caseid                      Number of cases    =      19832

Alternatives variable: selection               Alts per case: min =          6
                                                              avg =        6.0
                                                              max =          6

                                                  Wald chi2(12)   =    6798.96
Log pseudolikelihood = -20498.308                 Prob > chi2     =     0.0000

                                      (Std. err. adjusted for 43 clusters in fished_vessel_id)
----------------------------------------------------------------------------------------------
                             |               Robust
                      fished | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-----------------------------+----------------------------------------------------------------
selection                    |
                  mean_avail |   1.266931    .470993     2.69   0.007     .3438021    2.190061
                  mean_price |  -.8328412   .6792684    -1.23   0.220    -2.164183    .4985003
                diesel_price |    -.36118   .1536395    -2.35   0.019    -.6623078   -.0600522
             wind_max_220_mh |  -.0224909   .0059877    -3.76   0.000    -.0342266   -.0107551
                   d_missing |   1.154952    .334847     3.45   0.001     .4986643    1.811241
dist_port_to_catch_area_zero |  -.0130906   .0027044    -4.84   0.000    -.0183912     -.00779
                 d_missing_d |  -4.152571   .2665526   -15.58   0.000    -4.675005   -3.630138
                 dist_to_cog |  -.0096605    .000697   -13.86   0.000    -.0110265   -.0082944
                ddieselstate |    .223628   .1096246     2.04   0.041     .0087678    .4384883
                psdnclosured |   -.902468   .5359947    -1.68   0.092    -1.952998    .1480623
                msqdclosured |  -18.90299   .2793458   -67.67   0.000     -19.4505   -18.35549
                 msqdweekend |   -3.21246   .1562109   -20.56   0.000    -3.518627   -2.906292
-----------------------------+----------------------------------------------------------------
BDA_DCRB                     |
                       _cons |    8.29591   5.467444     1.52   0.129    -2.420083     19.0119
-----------------------------+----------------------------------------------------------------
BDA_MSQD                     |
                       _cons |   4.698966   1.032227     4.55   0.000     2.675838    6.722093
-----------------------------+----------------------------------------------------------------
CBA_MSQD                     |
                       _cons |   11.85364    1.72054     6.89   0.000     8.481442    15.22583
-----------------------------+----------------------------------------------------------------
ERA_MSQD                     |
                       _cons |   7.502677    1.19111     6.30   0.000     5.168145     9.83721
-----------------------------+----------------------------------------------------------------
LAA_BTNA                     |
                       _cons |   4.705973   2.344833     2.01   0.045     .1101857    9.301761
-----------------------------+----------------------------------------------------------------
LAA_CMCK                     |
                       _cons |   1.715587   .8898395     1.93   0.054    -.0284666     3.45964
-----------------------------+----------------------------------------------------------------
LAA_JMCK                     |
                       _cons |    2.55021   .7502889     3.40   0.001     1.079671    4.020749
-----------------------------+----------------------------------------------------------------
LAA_MSQD                     |
                       _cons |   3.824742   .9353521     4.09   0.000     1.991486    5.657998
-----------------------------+----------------------------------------------------------------
LAA_NANC                     |
                       _cons |   .1812961   .7102069     0.26   0.799    -1.210684    1.573276
-----------------------------+----------------------------------------------------------------
LAA_PBNT                     |
                       _cons |    3.55191   1.015846     3.50   0.000     1.560888    5.542933
-----------------------------+----------------------------------------------------------------
LAA_PSDN                     |
                       _cons |   1.788843    .748941     2.39   0.017      .320946    3.256741
-----------------------------+----------------------------------------------------------------
LAA_RHRG                     |
                       _cons |  -.9089746   .9763807    -0.93   0.352    -2.822646    1.004696
-----------------------------+----------------------------------------------------------------
LAA_STNA                     |
                       _cons |   4.046454   1.250171     3.24   0.001     1.596164    6.496743
-----------------------------+----------------------------------------------------------------
LAA_YTNA                     |
                       _cons |   2.974006   1.279449     2.32   0.020      .466333    5.481679
-----------------------------+----------------------------------------------------------------
MNA_ALBC                     |
                       _cons |   1.729953   2.255287     0.77   0.443    -2.690327    6.150234
-----------------------------+----------------------------------------------------------------
MNA_CMCK                     |
                       _cons |   3.089622   1.199996     2.57   0.010     .7376732     5.44157
-----------------------------+----------------------------------------------------------------
MNA_JMCK                     |
                       _cons |   2.706848   .6943102     3.90   0.000     1.346025    4.067671
-----------------------------+----------------------------------------------------------------
MNA_LSKT                     |
                       _cons |   6.139513   .9381593     6.54   0.000     4.300755    7.978272
-----------------------------+----------------------------------------------------------------
MNA_MSQD                     |
                       _cons |   3.750628   1.031797     3.64   0.000     1.728343    5.772913
-----------------------------+----------------------------------------------------------------
MNA_NANC                     |
                       _cons |   1.135863   .6513788     1.74   0.081     -.140816    2.412542
-----------------------------+----------------------------------------------------------------
MNA_PSDN                     |
                       _cons |   .7717243   .7105962     1.09   0.277    -.6210187    2.164467
-----------------------------+----------------------------------------------------------------
MNA_UDAB                     |
                       _cons |   9.541219    3.47646     2.74   0.006     2.727482    16.35496
-----------------------------+----------------------------------------------------------------
MRA_MSQD                     |
                       _cons |   1.876496   1.165429     1.61   0.107    -.4077038    4.160695
-----------------------------+----------------------------------------------------------------
NPA_MSQD                     |
                       _cons |    12.9726   1.240016    10.46   0.000     10.54222    15.40299
-----------------------------+----------------------------------------------------------------
No_Participation             |  (base alternative)
-----------------------------+----------------------------------------------------------------
SBA_CMCK                     |
                       _cons |   1.981507   .8803307     2.25   0.024     .2560908    3.706924
-----------------------------+----------------------------------------------------------------
SBA_JMCK                     |
                       _cons |   1.030883   1.329894     0.78   0.438    -1.575662    3.637427
-----------------------------+----------------------------------------------------------------
SBA_MSQD                     |
                       _cons |   4.081203   .9147837     4.46   0.000      2.28826    5.874146
-----------------------------+----------------------------------------------------------------
SBA_PBNT                     |
                       _cons |   3.641874   2.843087     1.28   0.200    -1.930474    9.214222
-----------------------------+----------------------------------------------------------------
SBA_PSDN                     |
                       _cons |   .3588901   .9457342     0.38   0.704    -1.494715    2.212495
-----------------------------+----------------------------------------------------------------
SBA_UMCK                     |
                       _cons |   5.864149   3.032482     1.93   0.053    -.0794067    11.80771
-----------------------------+----------------------------------------------------------------
SDA_BTNA                     |
                       _cons |   12.29686   5.114516     2.40   0.016     2.272595    22.32113
-----------------------------+----------------------------------------------------------------
SFA_CHNK                     |
                       _cons |   17.91165    9.15804     1.96   0.050     -.037783    35.86108
-----------------------------+----------------------------------------------------------------
SFA_DCRB                     |
                       _cons |   8.314179   5.807956     1.43   0.152    -3.069205    19.69756
-----------------------------+----------------------------------------------------------------
SFA_MSQD                     |
                       _cons |    4.54532   1.128086     4.03   0.000     2.334312    6.756328
-----------------------------+----------------------------------------------------------------
SFA_NANC                     |
                       _cons |   5.098876   1.306181     3.90   0.000     2.538809    7.658944
----------------------------------------------------------------------------------------------

. 
. 
end of do-file

. help nardl

. save c:\users\fequezad\appdata\local\temp\emergency_close_stata_st.dta, replace
(file c:\users\fequezad\appdata\local\temp\emergency_close_stata_st.dta not found)
file c:\users\fequezad\appdata\local\temp\emergency_close_stata_st.dta saved
