-----------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\GitHub\EconAnalysis\Participation\Results\Logs\preliminary.log
  log type:  text
 opened on:  14 Sep 2023, 19:27:16

. 
. ** Import data
. import delimited "Stata\rdo_Stata_c4.csv"
(encoding automatically selected: ISO-8859-1)
(36 vars, 118,992 obs)

. replace mean_price = mean_price / 1000
(98,875 real changes made)

. gen id_obs = _n

. gen const_r2 = 1

. 
. ** Merge historical selection
. preserve

.  import delimited "Stata\dbp_month_Stata_c4.csv", clear
(encoding automatically selected: ISO-8859-2)
(3 vars, 24 obs)

.  tempfile dbp_month

.  save dbp_month, replace
file dbp_month.dta saved

. restore

. 
. merge m:1 selection set_month using "dbp_month.dta"

    Result                      Number of obs
    -----------------------------------------
    Not matched                        83,455
        from master                    83,454  (_merge==1)
        from using                          1  (_merge==2)

    Matched                            35,538  (_merge==3)
    -----------------------------------------

. drop if _merge == 2
(1 observation deleted)

. replace hist_selection = 0 if _merge == 1
(83,454 real changes made)

. drop _merge

. 
. ** Set choice model database
. cmset fished_vessel_id time selection
note: case identifier _caseid generated from fished_vessel_id and time.
note: panel by alternatives identifier _panelaltid generated from fished_vessel_id and selection.
note: alternatives are unbalanced across choice sets; at least one choice set does not have all possible values of selection.

                    Panel data: Panels fished_vessel_id and time time
              Case ID variable: _caseid
         Alternatives variable: selection
Panel by alternatives variable: _panelaltid (unbalanced)
                 Time variable: time, 1 to 1823, but with gaps
                         Delta: 1 unit

Note: Data have been xtset.

. // cmset fished_haul selection
. sort id_obs

. 
. 
. 
. ******************************
. *** Calculate utilty fishery
. 
. * Preferred model (see below)  
. cmclogit fished mean_avail mean_price diesel_price wind_max_220_mh d_missing dist_port_to_catch_area_zero d_missing_d dist_to_cog ///
>                 ddieselstate psdnclosured msqdclosured msqdweekend i.dummy_prev_days, base("No-Participation")
note: data were cmset as panel data, and the default vcetype for panel data is vce(cluster fished_vessel_id); see cmclogit.
note: variable d_missing has 17454 cases that are not alternative-specific; there is no within-case variability.
note: variable dist_port_to_catch_area_zero has 5 cases that are not alternative-specific; there is no within-case variability.
note: variable d_missing_d has 6947 cases that are not alternative-specific; there is no within-case variability.
note: variable ddieselstate has 11708 cases that are not alternative-specific; there is no within-case variability.
note: variable psdnclosured has 17419 cases that are not alternative-specific; there is no within-case variability.
note: variable msqdclosured has 19102 cases that are not alternative-specific; there is no within-case variability.
note: variable msqdweekend has 16500 cases that are not alternative-specific; there is no within-case variability.
note: variable 1.dummy_prev_days has 3864 cases that are not alternative-specific; there is no within-case variability.

Iteration 0:  Log pseudolikelihood =  -16132.95  
Iteration 1:  Log pseudolikelihood = -15595.783  
Iteration 2:  Log pseudolikelihood = -15567.913  
Iteration 3:  Log pseudolikelihood = -15563.341  
Iteration 4:  Log pseudolikelihood = -15562.278  
Iteration 5:  Log pseudolikelihood = -15562.019  
Iteration 6:  Log pseudolikelihood = -15561.968  
Iteration 7:  Log pseudolikelihood =  -15561.96  
Iteration 8:  Log pseudolikelihood = -15561.958  
Iteration 9:  Log pseudolikelihood = -15561.958  
Iteration 10: Log pseudolikelihood = -15561.957  
Iteration 11: Log pseudolikelihood = -15561.957  

Conditional logit choice model                 Number of obs      =    118,992
Case ID variable: _caseid                      Number of cases    =      19832

Alternatives variable: selection               Alts per case: min =          6
                                                              avg =        6.0
                                                              max =          6

                                                  Wald chi2(13)   =    9097.60
Log pseudolikelihood = -15561.957                 Prob > chi2     =     0.0000

                                      (Std. err. adjusted for 43 clusters in fished_vessel_id)
----------------------------------------------------------------------------------------------
                             |               Robust
                      fished | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-----------------------------+----------------------------------------------------------------
selection                    |
                  mean_avail |   2.465321   .4827542     5.11   0.000      1.51914    3.411502
                  mean_price |  -.2911479    .303727    -0.96   0.338     -.886442    .3041461
                diesel_price |  -.0493563   .1625075    -0.30   0.761    -.3678651    .2691525
             wind_max_220_mh |  -.0304629   .0054135    -5.63   0.000    -.0410732   -.0198526
                   d_missing |   2.133549   .3909236     5.46   0.000     1.367353    2.899745
dist_port_to_catch_area_zero |  -.0078653    .002543    -3.09   0.002    -.0128495   -.0028811
                 d_missing_d |  -2.009707   .1924111   -10.44   0.000    -2.386826   -1.632588
                 dist_to_cog |  -.0051903   .0006583    -7.88   0.000    -.0064804   -.0039001
                ddieselstate |  -.0144063   .0947387    -0.15   0.879    -.2000907    .1712782
                psdnclosured |  -.2984186   .4034717    -0.74   0.460    -1.089209    .4923713
                msqdclosured |  -16.69341      .2743   -60.86   0.000    -17.23103   -16.15579
                 msqdweekend |  -3.343242   .1657722   -20.17   0.000     -3.66815   -3.018335
           1.dummy_prev_days |   3.039875   .0799434    38.03   0.000     2.883188    3.196561
-----------------------------+----------------------------------------------------------------
BDA_DCRB                     |
                       _cons |   -.475191   2.316481    -0.21   0.837    -5.015411    4.065029
-----------------------------+----------------------------------------------------------------
BDA_MSQD                     |
                       _cons |   .7785792   .9322594     0.84   0.404    -1.048616    2.605774
-----------------------------+----------------------------------------------------------------
CBA_MSQD                     |
                       _cons |   4.182202   1.233968     3.39   0.001     1.763669    6.600735
-----------------------------+----------------------------------------------------------------
ERA_MSQD                     |
                       _cons |   1.334019   .8426709     1.58   0.113    -.3175852    2.985624
-----------------------------+----------------------------------------------------------------
LAA_BTNA                     |
                       _cons |  -1.699008   1.216604    -1.40   0.163    -4.083509     .685492
-----------------------------+----------------------------------------------------------------
LAA_CMCK                     |
                       _cons |  -1.849511   .7309366    -2.53   0.011    -3.282121   -.4169021
-----------------------------+----------------------------------------------------------------
LAA_JMCK                     |
                       _cons |  -.5068421   .7109239    -0.71   0.476    -1.900227    .8865431
-----------------------------+----------------------------------------------------------------
LAA_MSQD                     |
                       _cons |  -.5536744   .6709268    -0.83   0.409    -1.868667     .761318
-----------------------------+----------------------------------------------------------------
LAA_NANC                     |
                       _cons |  -3.695619   .6658132    -5.55   0.000    -5.000589   -2.390649
-----------------------------+----------------------------------------------------------------
LAA_PBNT                     |
                       _cons |  -1.633761   .8579288    -1.90   0.057    -3.315271    .0477486
-----------------------------+----------------------------------------------------------------
LAA_PSDN                     |
                       _cons |  -1.906127    .685169    -2.78   0.005    -3.249033   -.5632199
-----------------------------+----------------------------------------------------------------
LAA_RHRG                     |
                       _cons |  -4.753383   .8784162    -5.41   0.000    -6.475047   -3.031719
-----------------------------+----------------------------------------------------------------
LAA_STNA                     |
                       _cons |  -.3570004   .9586318    -0.37   0.710    -2.235884    1.521884
-----------------------------+----------------------------------------------------------------
LAA_YTNA                     |
                       _cons |  -2.217992   .8616483    -2.57   0.010    -3.906791   -.5291921
-----------------------------+----------------------------------------------------------------
MNA_ALBC                     |
                       _cons |  -3.144353   1.160604    -2.71   0.007    -5.419096   -.8696106
-----------------------------+----------------------------------------------------------------
MNA_CMCK                     |
                       _cons |  -.8921781   .7492748    -1.19   0.234     -2.36073    .5763734
-----------------------------+----------------------------------------------------------------
MNA_JMCK                     |
                       _cons |  -1.394081   .6009848    -2.32   0.020     -2.57199   -.2161729
-----------------------------+----------------------------------------------------------------
MNA_LSKT                     |
                       _cons |   .8126744   .7455309     1.09   0.276    -.6485393    2.273888
-----------------------------+----------------------------------------------------------------
MNA_MSQD                     |
                       _cons |  -.9957585   .7321395    -1.36   0.174    -2.430725    .4392085
-----------------------------+----------------------------------------------------------------
MNA_NANC                     |
                       _cons |  -3.077821   .6388707    -4.82   0.000    -4.329984   -1.825657
-----------------------------+----------------------------------------------------------------
MNA_PSDN                     |
                       _cons |  -3.298468   .6136004    -5.38   0.000    -4.501103   -2.095833
-----------------------------+----------------------------------------------------------------
MNA_UDAB                     |
                       _cons |   1.372648   1.536769     0.89   0.372    -1.639363    4.384659
-----------------------------+----------------------------------------------------------------
MRA_MSQD                     |
                       _cons |  -1.414898   .8144895    -1.74   0.082    -3.011268    .1814723
-----------------------------+----------------------------------------------------------------
NPA_MSQD                     |
                       _cons |   4.499123   .8988191     5.01   0.000      2.73747    6.260776
-----------------------------+----------------------------------------------------------------
No_Participation             |  (base alternative)
-----------------------------+----------------------------------------------------------------
SBA_CMCK                     |
                       _cons |  -.9511868   .6482573    -1.47   0.142    -2.221748    .3193741
-----------------------------+----------------------------------------------------------------
SBA_JMCK                     |
                       _cons |   -1.40577   1.039289    -1.35   0.176    -3.442738    .6311991
-----------------------------+----------------------------------------------------------------
SBA_MSQD                     |
                       _cons |  -.4795343   .6467042    -0.74   0.458    -1.747051    .7879827
-----------------------------+----------------------------------------------------------------
SBA_PBNT                     |
                       _cons |  -1.675616   1.377574    -1.22   0.224    -4.375612    1.024379
-----------------------------+----------------------------------------------------------------
SBA_PSDN                     |
                       _cons |  -2.661612   .8840057    -3.01   0.003    -4.394231   -.9289921
-----------------------------+----------------------------------------------------------------
SBA_UMCK                     |
                       _cons |  -.4687889   1.504301    -0.31   0.755    -3.417164    2.479586
-----------------------------+----------------------------------------------------------------
SDA_BTNA                     |
                       _cons |   2.767583   2.316356     1.19   0.232    -1.772392    7.307558
-----------------------------+----------------------------------------------------------------
SFA_CHNK                     |
                       _cons |   5.208844    4.07376     1.28   0.201     -2.77558    13.19327
-----------------------------+----------------------------------------------------------------
SFA_DCRB                     |
                       _cons |  -.3739193    2.50376    -0.15   0.881    -5.281198     4.53336
-----------------------------+----------------------------------------------------------------
SFA_MSQD                     |
                       _cons |  -.4867205    .804624    -0.60   0.545    -2.063755    1.090314
-----------------------------+----------------------------------------------------------------
SFA_NANC                     |
                       _cons |  -.2735546   .8482878    -0.32   0.747    -1.936168    1.389059
----------------------------------------------------------------------------------------------

. 
. gen species = substr(selection,-4,.) 

. 
end of do-file

. do "c:\users\fequezad\appdata\local\temp\st_stata_temp.tmp"

. replace species = . if species == "tion"
type mismatch
r(109);

end of do-file

r(109);

. do "c:\users\fequezad\appdata\local\temp\st_stata_temp.tmp"

. replace species = . if species == "tion"
type mismatch
r(109);

end of do-file

r(109);

. replace species = . if species == "tio
> n"
type mismatch
r(109);

. do "c:\users\fequezad\appdata\local\te
> mp\st_stata_temp.tmp"

. replace species = "." if species == "t
> ion"
(19,832 real changes made)

. 
end of do-file

. do "c:\users\fequezad\appdata\local\te
> mp\st_stata_temp.tmp"

. gen mean_avail_modified = mean_avail

. replace mean_avail_modified = 0 if spe
> cies == "MSQD"
(61,369 real changes made)

. 
end of do-file

. do "c:\users\fequezad\appdata\local\te
> mp\st_stata_temp.tmp"

. margins, at(mean_avail=gen(mean_avail)
> ) at(mean_avail=gen(mean_avail_modifie
> d))
--Break--
r(1);

end of do-file

--Break--
r(1);

. do "c:\users\fequezad\appdata\local\temp\st_stata_temp.tmp"

. margins, at(mean_avail=gen(mean_avail)) at(mean_avail=gen(mean_avail_modified))
--Break--
r(1);

end of do-file

--Break--
r(1);

. do "c:\users\fequezad\appdata\local\temp\st_stata_temp.tmp"

. margins, at(mean_avail=gen(mean_avail)) at(mean_avail=gen(mean_avail_modified))
unable to allocate matrix;
    You have attempted to create a matrix with too many rows or columns or attempted to fit a model with too many variables.

    You are using Stata/BE which supports matrices with up to 800 rows or columns.  See limits for how many more rows and columns Stata/SE and Stata/MP can support.

    If you are using factor variables and included an interaction that has lots of missing cells, try set emptycells drop to reduce the required matrix size; see help set emptycells.

    If you are using factor variables, you might have accidentally treated a continuous variable as a categorical, resulting in lots of categories.  Use the c. operator on such variables.
r(915);

end of do-file

r(915);

. do "c:\users\fequezad\appdata\local\temp\st_stata_temp.tmp"

. set emptycells drop

. 
end of do-file

. do "c:\users\fequezad\appdata\local\temp\st_stata_temp.tmp"

. margins, at(mean_avail=gen(mean_avail)) at(mean_avail=gen(mean_avail_modified)) set emptycells drop
option set not allowed
r(198);

end of do-file

r(198);

. do "c:\users\fequezad\appdata\local\temp\st_stata_temp.tmp"

. set emptycells drop

. margins, at(mean_avail=gen(mean_avail)) at(mean_avail=gen(mean_avail_modified))
