----------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\GitHub\EconAnalysis\Participation\Results\Logs\preliminary.log
  log type:  text
 opened on:  23 Nov 2023, 10:17:27

. 
. ** Import data
. import delimited "C:\Data\PacFIN data\rdo_Stata_c4.csv"
(encoding automatically selected: ISO-8859-1)
(51 vars, 176,730 obs)

. replace mean_price = mean_price / 1000
(147,275 real changes made)

. replace mean_price2 = mean_price2 / 1000
(136,955 real changes made)

. replace pricefishmealafi = pricefishmealafi / 1000
(176,730 real changes made)

. gen exp_cost_cog = diesel_price * dist_to_cog 

. gen exp_cost_catch_area = diesel_price * dist_port_to_catch_area_zero

. gen id_obs = _n

. gen const_r2 = 1

. 
end of do-file

